app/controllers/semesters_controller.rb

    def home
        @semesters = Semester.order(:year)
---
SELECT "semesters".* FROM "semesters" ORDER BY "semesters"."year" ASC

    def show
        session[:return_to] ||= request.referer
        @semester = Semester.find(params[:id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @semester = Semester.new(semester_params)

        if params[:student_csv].present?
            @semester.student_csv.attach(params[:student_csv])
        end

        if params[:client_csv].present?
            @semester.client_csv.attach(params[:client_csv])
        end

        if @semester.save
---
INSERT INTO "semesters" ("year", "semester", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["year", 2024], ["semester", "Spring"], ["created_at", "2024-03-25 17:16:23.109308"], ["updated_at", "2024-03-25 17:16:23.109308"]]
INSERT INTO "semesters" ("year", "semester", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["year", 2021], ["semester", "Spring"], ["created_at", "2024-03-26 19:50:19.928386"], ["updated_at", "2024-03-26 19:50:19.928386"]]

    def edit
        session[:return_to] ||= request.referer
        @semester = Semester.find(params[:id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @semester = Semester.find(params[:id])
        if @semester.update(params.require(:semester).permit(:semester, :year, :student_csv, :client_csv))
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "semesters" SET "updated_at" = $1 WHERE "semesters"."id" = $2  [["updated_at", "2024-03-26 19:50:57.975028"], ["id", 2]]

    def team
        @semester = Semester.find(params[:semester_id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]