app/controllers/semesters_controller.rb

  def classlist
    @semester = Semester.find(params[:id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]